#include "cache.h"


int main()
{
    using Cache = Cache_t<int, int>;
    Cache my_c = Cache(4);

    my_c.request(2);

    return 0;
}

/**
 * получаем данные
 * хэшируем
 *
 * смотрим, есть ли в мапе такой ключ
 * если есть:
 *   сравниваем данные в листе элементов бакетов с входными
 *   если нашли совпадение:
 *     возвращаем итератор на найденный элемент листа
 *     КОНЕЦ
 *
 *   если не нашли:
 *     put_in_cache();
 *     КОНЕЦ
 *
 * если нет:
 *   создаем новый элемент мапа
 *   put_in_cache();
 *   КОНЕЦ
 *
 *
 *
 * func put_in_cache():
 *   смотрим хватает ли места в листе
 *
 *   если да:
 *     new_elem();
 *     КОНЕЦ
 *
 *   если нет:
 *     ищем элемент с наим числом вызовов
 *     удаляем его
 *
 *     new_elem();
 *     КОНЕЦ
 *
 *
 *
 * func new_elem():
 *   кладем в лист новый элемент
 *   создаем в мапе по нужному ключу новый бакет с этим элементом
 *   возвращаем итератор на этот элемент листа
 *   КОНЕЦ
 */
